---
kind: method
id: M:Autodesk.Revit.DB.EdgeArray.Append(Autodesk.Revit.DB.Edge)
source: html/438a78de-4faa-cbc1-d90e-db17e4230ce8.htm
---
# Autodesk.Revit.DB.EdgeArray.Append Method

Add the edge to the end of the array.

## Syntax (C#)
```csharp
public virtual void Append(
	Edge item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Edge`) - The edge to be added.